{"podcast_details": {"podcast_title": "Reflections of History", "episode_title": "Reflections of History is going on Hiatus", "episode_image": "https://megaphone.imgix.net/podcasts/26540ab6-9d49-11eb-9ab7-33b2ab898c12/image/Reflections_of_History_Audacy_WEB.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " Shining City Audio, a John Meacham and C13 original studio. Your fever is high and the pressure to log in at work is too. But when you finally decide to take care of you, there's Instacart. Just because that one perfect co-worker of yours is attending all meetings, camera on while she's sneezing, coughing, and aching, doesn't mean you have to do the same. Take it from us. Trying to stay on top of things will only get you further behind. Instead, get everything from tissues and teas to cough suppressants and comforting soups delivered through Instacart in as fast as 30 minutes. If anyone needs anything, they can just redirect their questions to that one perfect co-worker of yours. Reflections of history is going on hiatus for a time. We'll be back soon, going back to our daily reflections on what happened on this date and what it might mean for us. Thanks so much for listening and we'll be back in touch. I think Don Siegel was one of the great action directors in the history of Hollywood. But none of it aired until now. My name is Louise Stratton. Listen and follow One Hand Shake Away, an Odyssey Original, available now for free on the Odyssey app and wherever you get your podcasts. That's it for now, folks."}, "podcast_summary": "- The podcast, \"Reflections of History,\" is going on hiatus for a while but will return soon.\n- The podcast discusses historical events and their significance.\n- The ad for Instacart promotes their delivery service for various items including tissues, teas, cough suppressants, and soups.\n- The podcast, \"One Hand Shake Away,\" featuring director Don Siegel, is available on the Odyssey app and other podcast platforms.", "podcast_highlights": "- The podcast host announces that \"Reflections of history\" is going on hiatus for a while and will be back soon, indicating a temporary pause in the show.\n- The podcast guest, Louise Stratton, mentions Don Siegel as one of the great action directors in Hollywood history, providing an interesting insight into Siegel's career and influence."}